# Projeto 01

### Com o aumento do IDH, o consumo de álcool tende a cair?

In [1]:
import pandas as pd
import matplotlib.pyplot as plt

% matplotlib inline

In [2]:
alcool=pd.read_csv('alcohol_consumption.csv')
GDPcapita=pd.read_csv('gdppercapita_us_inflation_adjusted.csv')
IDH=pd.read_csv('hdi_human_development_index.csv')
life=pd.read_csv('life_expectancy_years.csv')

In [7]:
GDP_alcool=GDPcapita.join(alcool, how='inner', lsuffix='alc')

In [10]:
GDP_alcool.head(3)

,geoalc,1960,1961,1962,1963,1964,1965,1966,1967,1968,...,1999,2000,2001,2002,2003,2004,2005,2006,2007,2008
0,Afghanistan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,0.02,NaN,NaN,0.03
1,Albania,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,6.68,NaN,NaN,7.29
2,Algeria,2470.0,2080.0,1630.0,2130.0,2200.0,2280.0,2110.0,2240.0,2410.0,...,NaN,NaN,NaN,NaN,NaN,NaN,0.96,NaN,NaN,0.69

In [11]:
GDPcapita.head(3)

,geo,1960,1961,1962,1963,1964,1965,1966,1967,1968,...,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016
0,Afghanistan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,440.0,445.0,525.0,553,569.0,630.0,634.0,630.0,620.0,618.0
1,Albania,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,3610.0,3780.0,3930.0,4090,4210.0,4280.0,4330.0,4410.0,4520.0,4680.0
2,Algeria,2470.0,2080.0,1630.0,2130.0,2200.0,2280.0,2110.0,2240.0,2410.0,...,4360.0,4390.0,4390.0,4460,4500.0,4560.0,4600.0,4680.0,4760.0,4830.0

In [12]:
alcool.head(3)

,geo,1985,1986,1987,1988,1989,1990,1991,1992,1993,...,1999,2000,2001,2002,2003,2004,2005,2006,2007,2008
0,Afghanistan,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,0.02,NaN,NaN,0.03
1,Albania,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,6.68,NaN,NaN,7.29
2,Algeria,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,0.96,NaN,NaN,0.69